[{
  "logo" : "images/projects/fraunhofer_igd.png",
  "alttext" : "Fraunhofer IGD logo",
  "title" : "Fraunhofer IGD Kooperation I",
  "goal": "Visual Analysis of Large Relational, Time-Dependent and Multi-Dimensional Data.",
  "duration": "01/2011 - 12/2011",
  "abstract" : "In cooperation with Fraunhofer IGD Darmstadt, we are conducting basic research in the field of Visual Analysis of Large, Relational, Time-Dependent and Multi-Dimensional Data. Multi-dimensional, time-dependent relational data, whether it is used to represent a social network, an IP network, or a power grid, is omnipresent. In these often very large datasets    each entry may contain numerous multi-dimensional or time-dependent subentries, as depicted in Figure 1. As one example, health status messages of network nodes deliver for every time    step an array of readings, which may need to be processed and visuallized effectively so that potential patterns can be recognized by analysts. Well-known and proven visual representations exist for network, time-dependent and multidimensional data types each. The \"goal\" of this project is to research integrated visual analytics approaches for making sense of large data sets consisting of relational, time-dependent and multivariate facets. Research questions we are addressing deal with the definition of novel visual representations integrating these data aspects. Adaptivity of the representations should support semantic zoom operations for effective user navigation in large data sets. Furthermore, based on appropriately defined similarity notions, data reduction and layout generation will be considered in this project."
},{
  "logo" : "images/projects/fraunhofer_igd.png",
  "alttext" : "Fraunhofer IGD logo",
  "title" : "Fraunhofer IGD Kooperation II",
  "goal": "Research and Development of Visual Interactive Techniques for the Analysis of Large Matrix Data.",
  "duration": "01/2012 - 12/2013",
  "abstract" : "Erforschung und Entwicklung von visuell-interaktiven Techniken in den Bereichen Analyse von großen Matrizen-Daten, sowie Analyse von Raumzeitdaten Im Rahmen des Projektes wurden grundlegende Fragestellungen und technische Ansätze betrachtet, welche für die genannten Fragestellungen geeignet sind. Ausgewählte Ansätze wurden prototypisch implementiert. Zu nennen sind hier insb. die Matrix-of-Matrices Implementierung und die Matrix Projection Explorer Visualisierungsprototypen. Im Rahmen der Arbeiten im Jahr 2012 wurden zwei Publikationen vorgenommen:   Ein peer-reviewtes Poster wurde zur frühen Idee des Matrix-of-Matrices Ansatzes auf der VisWeek 2012 veröffentlicht. Ziel des Ansatzes ist der visuelle Vergleich von Korrelationen auf verschiedenen Zeitreihen-Intervallen.   Zweitens wurde eine Publikation im EuroVis Workshop on Visual Analytics 2013 unter dem Titel „Visual Comparison of Orderings and Rankings” vorgenommen. Ziel dieser Arbeit ist der visuelle Vergleich von Rankings, wie sie z.B. durch eine Matrixsortierung entsteht. Grundlagenforschung im Bereich von Matrix-Daten Analyse. Im Rahmen des Projektes wurden grundlegende Fragestellungen betrachtet, die insbesondere auf die Interaktion und den visuellen Vergleich von Matrix Daten abzielen. Es wurde hierzu beispielsweise der projektionsbasierte Vergleichsansatz für Matrizen entwickelt. Die Forschungsfragen zum Vergleich von Matrix Daten basierend auf visuellen Deskriptoren sind ausformuliert und ein erster Prototyp wurde implementiert. Ausarbeitung und Weiterentwicklung der Arbeiten aus dem Vorjahr 2012, insb.:   Entwicklung und Verbesserung der projektionsbasierten Ähnlichkeitsfunktion für Matrizen und Entwicklung und Verbesserung der projektionsbasierten Interaktion zur Matrixsortierung. Im Rahmen der Arbeiten im Jahr 2013 wurden drei Publikationen vorgenommen. Für das Computers and Graphics Journal wurde die Publikation „User-Steerable Iterative Matrix Reordering“ eingereicht und im Rahmen der IEEE Conference on Visual Analytics Science and Technology wurde diese Publikation wieder aufgegriffen, weiterentwickelt und letztendlich wieder eingereicht.   Der Prototyp zur Publikation „Visual Analysis of Sets of Heterogeneous Matrices Using Projection-Based Distance Functions and Semantic Zoom“ wurde im Rahmen des Projektes signifikant zur Vorversion aus dem Jahr 2012 verbessert und ausgebaut. Resultierend hieraus ist eine akzeptierte Einreichung auf der Eurographics Conference on Visualization (EuroVis) 2014. Experimentelle Anwendung und Publikationen der gemeinsamen Ergebnisse. Weitere Publikationen resultierten aus der Zusammenarbeit und den Forschungsbesprechungen. Als ein Beispiel wurde im Rahmen der IEEE Conference on Visual Analytics Science and Technology die Publikation „Using Matrices to Explore Aggregate Similarity for Multi-Dimensional Clustering“ eingereicht. Des Weiteren sind auch weitere Publikation und Zusammenarbeiten geplant und anstehend. "
},{
  "logo" : "images/projects/vissense_logo.png",
  "alttext" : "Vissense logo",
  "title" : "Vis-Sense",
  "goal": "Visual Analytic Representation of Large Datasets for Enhanced Network Security.",
  "duration": "01/2012 - 12/2013",
  "link" : "http://www.vis-sense.eu/",
  "abstract" : "VIS-SENSE was an EU-funded research project focused on the development of visual analytics technologies for the enhancement of international network security. The VIS-SENSE project uses visualization and data-mining technologies to identify and predict complex patterns of abnormal behaviour. The VIS-SENSE team works in various application areas ranging from network information security and attack attribution to attack prediction and the detection of BGP hijacking. The ultimate goal of VIS-SENSE is to stimulate proactive measures, which improve efforts to combat cyber-crime, and also to enhance the prediction of attacks. "
},{
  "logo" : "images/projects/vasa_logo.png",
  "alttext" : "Vasa Logo",
  "title" : "VASA",
  "goal": "Visual Analytics for Security Applications.",
  "duration": "01/2012 - 12/2013",
  "link" : "http://www.va-sa.net/",
  "abstract" : "The goal of VASA (Visual Analytics for Security Applications) is to apply visual analytics to disaster prevention and crisis response, with a focus on critical infrastructures in logistics, transportation, food safety, digital networks and power grids at the national levels. The connectedness and dependency of these critical infrastructures make the problem of monitoring and understanding their functioning and dependencies one of the most complex analytical tasks faced by our societies. Their proper functioning is crucial for the well-being of the population, economic viability, and most of all to prevent loss of life. Visual analytics is the science of analytical reasoning facilitated by interactive visual interfaces. It provides technology that combines the strengths of human and electronic data processing enabling a semi-automated analytical process, where humans and machines cooperate using their respective distinct capabilities. The VASA project proposes the application of visual analytics to the problems of monitoring and understanding critical infrastructures, cascading infrastructure effects, and to the management of crisis response. While, for example, there exist detailed models for individual types of infrastructures such as electric power grids, these do not encompass the various interconnections and interdependencies one needs to be aware of to make risk estimation decisions and for performing operational risk management. What is therefore required is a mechanism for conjoining the information available for individual infrastructure sectors and providing unified views and analytical tools for planning and decision support. VASA is conceived as a three-year project and is realized by a consortium of research, industrial, and public partners from Germany. "
},{
  "logo" : "images/projects/consensus_logo.png",
  "alttext" : "Concensus Logo",
  "title" : "CONSENSUS",
  "goal": "Multi-Objective Decision Making Tools through Citizen Engagement.",
  "duration": "10/2013 - 04/2015",
  "link" : "http://www.consensus-project.eu/",
  "abstract" : "Policy makers are faced on daily basis with different policy choices and objectives that, more often than not, are subject to inherent conflicts, implying underlying trade-offs that need to be taken into account. For example, if a policymaker wishes to construct a road, he has to consider a number of factors amongst others, the cost of the investment, its socio-economic return in terms of social cohesion and economic trade, environmental aspects, safety considerations and so on. How can a policymaker be certain that he has calibrated these different elements in a balanced way? In what could be potentially the solution, the CONSENSUS project will strive to model existing real world user cases and deliver the tools that can, in an easy and comprehensive manner, provide policy makers with optimal choices based on a number of relevant criteria. This investigation is meant to cover two important real world user-cases in the project: One dealing with Biofuels and Climate Change (EU Renewable Energy Directive), and the other dealing with the Trans-European Transport Networks (TEN-T). Last but not least, one of the goal s of CONSENSUS is to involve citizens’ in the policymaking scheme since their input can potentially become highly valuable in various stages, from the gathering of the necessary data, through formulating public opinion as one of the objectives in the model, to eventually playing the role of exploring the attained trade-offs and contributing to their weighing."
},{
  "logo" : "images/projects/bosch.png",
  "alttext" : "Bosch Logo",
  "title" : "Bosch Visualization for the Powerwall",
  "goal": "Interactive Visualization for a Wall-sized Display (Powerwall).",
  "duration": "10/2015 - 04/2016",
  "abstract" : "We developed together with Bosch Research in Renningen a WebGL-based prototype to explore a large and multi-faceted car dataset."
},{
  "logo" : "images/projects/siemens.png",
  "alttext" : "Siemens Logo",
  "title" : "Commercial Visual Analytics Systems Survey",
  "goal": "Scan and assess the current State-of-the-Art of the Commercial Visual Analytics Systems.",
  "link": "http://commercialtools.dbvis.de",
  "duration": "01/2017 - 05/2017",
  "abstract" : "Five years after the first state-of-the-art report on Commercial Visual Analytics Systems we present an update and supplemental increment on the developments in the Big Data Analytics field. With our paper, we want to build on the success of the 2012 survey, which was influential even beyond the boundaries of the InfoVis and Visual Analytics community. In our comparative approach, we not only reevaluate most systems taken into account in the previous report but also contrast advances in the field with the latest research. To assure comparability we reevaluate systems on established evaluation criteria like available features, performance, and usability. Additionally, we introduce novel metrics, like suitability for specific user groups or the ability of complex data type handling, and a new use case study to highlight innovative features. Further, we investigate previously unavailable products to complete the commercial VA landscape. Our major goal is to emphasize the achievements in the commercial sector regarding proclaimed Visual Analytics challenges and to give suggestions, which novel developments might need to be on systems’ roadmaps in the next years."
},{
  "logo" : "images/projects/4dn.png",
  "alttext" : "4DN Logo",
  "title" : "4DN Genome Interaction Matrix Pattern Exploration",
  "goal": "Analysis of Local Patterns in Genome Interaction Matrices",
  "link": "http://www.4dnucleome.org/",
  "duration": "05/2017 - 05/2019",
  "abstract" : "The goals of the 4D Nucleome (4DN) Data Coordination and Integration Center (DCIC) are to collect, store, curate, display, and analyze data generated in the 4DN Network. We have assembled a team of investigators with a strong track record in analysis of chromatin interaction data, image processing and three-dimensional data visualization, integrative analysis of genomic and epigenomic data, data portal development, large-scale computing, and development of secure and flexible cloud technologies."
}]
